app/controllers/sessions_controller.rb

def create
  auth = request.env["omniauth.auth"]

  user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at") VALUES ('twitter', '61296583', 'Baiyun Online', '2011-04-29 23:09:03.085846', '2011-04-29 23:09:03.085846')
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '61296583' LIMIT 1